uas-loket-shobahus-s/ci4/app/Controllers/Loket.php

  public function delete($id)
  {
    $this->AntrianModel->delete($id);
---
DELETE FROM `antrian`
WHERE `id` IN ('4')